app/controllers/products_controller.rb

  def new
    @product = Product.new
    @brands = Brand.all.map do |brand|
---
SELECT "brands".* FROM "brands"

  def create
    @product = Product.new(product_params)

     if @product.save
---
INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at", "brand_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Shoe"], ["description", "This is the best"], ["price", 1000], ["created_at", "2021-05-30 03:07:23.351379"], ["updated_at", "2021-05-30 03:07:23.351379"], ["brand_id", 13]]

  def edit
    @brands = Brand.all.map do |brand|
---
SELECT "brands".* FROM "brands"

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "name" = $1, "description" = $2, "updated_at" = $3, "brand_id" = $4 WHERE "products"."id" = $5  [["name", "Ball"], ["description", "good "], ["updated_at", "2021-05-30 01:38:06.287153"], ["brand_id", 13], ["id", 66]]