app/views/products/_form.html.erb

SELECT "brands".* FROM "brands"
---
<%= form.label :brand_id, class:"form-label" %>
<%= form.collection_select(:brand_id, Brand.all, :id, :name,class:'form-control') %>