app/views/products/show.html.erb


<% @product.ratings.each do |rating|%>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."product_id" = $1  [["product_id", 21]]